---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.PlasticModulusWeakAxis
source: html/0c10c247-f3e3-2b08-8eb7-eaf8e465a800.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.PlasticModulusWeakAxis Property

Plastic section modulus in bending about main weak axis.

## Syntax (C#)
```csharp
public double PlasticModulusWeakAxis { get; set; }
```